app/controllers/pets_controller.rb

  def index
    # get data on all pets and paginate the output to 10 per page
    if current_user.role?(:owner)
      @active_pets = current_user.owner.pets.active.alphabetical.paginate(page: params[:page]).per_page(10)
---
SELECT  "pets".* FROM "pets" WHERE "pets"."owner_id" = ? AND ("pets"."active" != ?) ORDER BY name LIMIT ? OFFSET ?  [["owner_id", 1], ["active", "t"], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "pets" WHERE "pets"."owner_id" = ? AND ("pets"."active" != ?)  [["owner_id", 1], ["active", "t"]]
SELECT  "owners".* FROM "owners" WHERE "owners"."user_id" = ? LIMIT ?

  def set_pet
    @pet = Pet.find(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?