app/models/ability.rb

SELECT  "owners".* FROM "owners" WHERE "owners"."user_id" = ? LIMIT ?
---

      # they can read their own pets' data
      can :show, Pet do |this_pet|
        my_pets = user.owner.pets.map(&:id)